reticulous/reticulous/esp-idf/sdkconfig.defaults
# WiFi — don't let the WiFi blob cache SSID/BSSID/channel in NVS. Two reasons:
# (1) silent auto-reconnect via cached state would bypass net.cpp's connection
# management. (2) avoids mid-session NVS writes from the radio firmware that
# can disrupt active traffic. PHY-cal NVS writes at boot are unaffected.
CONFIG_ESP_WIFI_NVS_ENABLED=n

# Camera — legacy I2C driver: OV2640 needs this; new driver (sccb-ng) times out on
# every transaction. Re-verify OV3660 exposure after flipping.
CONFIG_SCCB_HARDWARE_I2C_DRIVER_LEGACY=y

# Camera — only compile JPEG-capable sensors (see supported_cameras.md).
# Keeps binary smaller and skips fruitless probes for sensors we can't use.
CONFIG_OV2640_SUPPORT=y
CONFIG_OV3660_SUPPORT=y
CONFIG_OV5640_SUPPORT=y
# NT99141 disabled — driver is broken upstream, can't get frames.
# See docs/supported_cameras.md §3 for full investigation history.
CONFIG_NT99141_SUPPORT=n
# MEGA_CCM is JPEG-capable but SPI-interfaced — not XIAO Sense compatible.
CONFIG_MEGA_CCM_SUPPORT=n
CONFIG_OV7670_SUPPORT=n
CONFIG_OV7725_SUPPORT=n
CONFIG_GC2145_SUPPORT=n
CONFIG_GC032A_SUPPORT=n
CONFIG_GC0308_SUPPORT=n
CONFIG_BF3005_SUPPORT=n
CONFIG_BF20A6_SUPPORT=n
CONFIG_SC101IOT_SUPPORT=n
CONFIG_SC030IOT_SUPPORT=n
CONFIG_SC031GS_SUPPORT=n
CONFIG_HM1055_SUPPORT=n
CONFIG_HM0360_SUPPORT=n

# Camera — PSRAM DMA disabled for now (causes NO-EOI on some sensors)
# CONFIG_CAMERA_PSRAM_DMA=y

# lwIP — sockets (web 6 clients + HTTP/HTTPS/RTSP/WS/RTSPS/log/logs/cli/clis servers + clients)
CONFIG_LWIP_MAX_SOCKETS=24

# lwIP — RTSP streaming
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=16384
CONFIG_LWIP_TCP_WND_DEFAULT=16384
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_TCP_OVERSIZE_MSS=y
CONFIG_LWIP_IRAM_OPTIMIZATION=y

# lwIP — PPP support (workaround for ESP-IDF 5.x netif->state conflict with WireGuard)
CONFIG_LWIP_PPP_SUPPORT=y

# WiFi TX — larger BA window + more dynamic TX buffers for bursty video
CONFIG_ESP_WIFI_TX_BA_WIN=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64

# PSRAM — 8MB OPI, malloc() prefers PSRAM for all allocations
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
# Reserve 48KB of internal DRAM — SDMMC DMA bounce + WiFi/lwIP/mbedTLS need room
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=49152

# Per-task heap ownership tracking (for heapDump on malloc failures)
CONFIG_HEAP_TASK_TRACKING=y

# Flash — 8MB QIO
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# Power management + tickless idle (required for automatic light sleep)
CONFIG_PM_ENABLE=y
CONFIG_PM_PROFILING=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# JPEG decoder — use software TJpgDec (not ROM), with default Huffman tables
# ROM tjpgd (R0.02) lacks JD_DEFAULT_HUFFMAN → fails on OV5640 JPEG output
CONFIG_JD_USE_ROM=n
CONFIG_JD_DEFAULT_HUFFMAN=y

# FAT — long filenames (strftime patterns exceed 8.3).
# exFAT was removed from ESP-IDF 5.4 menuconfig — SD cards must be FAT32.
CONFIG_FATFS_LFN_HEAP=y

# C++ — no exceptions or RTTI (not used)
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS — task stats for 'top' command
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y

# Log — compile-time max level (runtime filtering via esp_log_level_set)
# Boot at INFO (quiet), compile VERBOSE so all levels work at runtime via "set log=..."
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# Task watchdog — don't monitor IDLE1 (core 1 runs RTSP + web streaming tasks)
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# Console over USB Serial JTAG (XIAO has no UART0 pins exposed)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# IDF 5.5+: auto-hold a NO_LIGHT_SLEEP lock while USB host is connected.
# Without this, light sleep gates the USB clock → no SOF packets →
# usb_serial_jtag_is_connected() returns false → vfs_read/write start
# returning -1 → serial console dies (logs may still scrape through during
# bursty wakes, but stdin reads return -1, so the serial CLI input path
# stops working). See esp-idf .../usb_serial_jtag_connection_monitor.c.
CONFIG_USJ_NO_AUTO_LS_ON_CONNECTION=y

# Main task stack — mbedTLS EC key generation needs ~10KB
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Default 2304: WiFi + esp_netif + our log path can overflow sys_evt on first connect
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=8192

# mbedTLS — TLS server with EC P-256 self-signed cert generation
# CONFIG_MBEDTLS_SSL_PROTO_TLS1_3 is not set
CONFIG_MBEDTLS_TLS_SERVER=y
CONFIG_MBEDTLS_TLS_SERVER_AND_CLIENT=y
CONFIG_MBEDTLS_SERVER_SSL_SESSION_TICKETS=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_ECDSA=y
CONFIG_MBEDTLS_ECDSA_C=y
CONFIG_MBEDTLS_ECP_C=y
CONFIG_MBEDTLS_ECP_DP_SECP256R1_ENABLED=y
# PK_WRITE_C / X509_CRT_WRITE_C / X509_CREATE_C are unconditionally on in
# ESP-IDF 5.4's mbedtls port (no longer a menuconfig option).
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# DTLS 1.2 (WebRTC DataChannel transport)
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
# ChaCha20-Poly1305 cipher suite — faster in software than AES-GCM on Xtensa
# (no table lookups, pure ARQ/add/rotate ops). Avoids the ESP32-S3 hardware
# AES-GCM DMA bug (espressif/esp-idf#12689) entirely.
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_ECDSA=y
# Hardware AES off — we negotiate ChaCha20-Poly1305, no AES path is live.
# Also pre-empts the GCM DMA bug (#12689) from any future AES use.
CONFIG_MBEDTLS_HARDWARE_AES=n
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=16384
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=8192

# mDNS — task stack in PSRAM (allocations stay in DRAM for speed)
CONFIG_MDNS_TASK_CREATE_FROM_SPIRAM=y

# Target
CONFIG_IDF_TARGET="esp32s3"
